<a href="https://colab.research.google.com/github/Riddhi180605/Internship_Work/blob/main/task3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Create and Inspect: Create a DataFrame from the data dictionary. Print the specific shape of the DataFrame (rows, columns) and show the data types of all columns.

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

data = {"Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"],
      "Age": [25, 30, 35, 40, 22, 28, 45],
      "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio"],
      "Salary": [70000, 80000, 120000, 90000, 60000, 75000, 110000]}

df = pd.DataFrame(data)
print(df)
print("\n(rows , cols) : ",df.shape)
print("\nAll Columns Data Type : \n" , df.dtypes)

      Name  Age          City  Salary
0    Alice   25      New York   70000
1      Bob   30   Los Angeles   80000
2  Charlie   35       Chicago  120000
3    David   40       Houston   90000
4      Eva   22       Phoenix   60000
5    Frank   28  Philadelphia   75000
6    Grace   45   San Antonio  110000

(rows , cols) :  (7, 4)

All Columns Data Type :
 Name      object
Age        int64
City      object
Salary     int64
dtype: object

Custom Index creation:

Create a new DataFrame df_custom from data but set the index to be specific IDs: ['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7'].

In [ ]:
df_custom = pd.DataFrame(data,index=['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7'])
print(df_custom)

        Name  Age          City  Salary
ID1    Alice   25      New York   70000
ID2      Bob   30   Los Angeles   80000
ID3  Charlie   35       Chicago  120000
ID4    David   40       Houston   90000
ID5      Eva   22       Phoenix   60000
ID6    Frank   28  Philadelphia   75000
ID7    Grace   45   San Antonio  110000

Column Selection: Create a new DataFrame df_subset containing only the "Name" and "Salary" columns from df.

In [ ]:
df_subset = df[['Name', 'Salary']]
print(df_subset)

      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie  120000
3    David   90000
4      Eva   60000
5    Frank   75000
6    Grace  110000

Row Slicing (Integer): Use iloc to select rows 2 through 5 (inclusive of index 2, exclusive of 5 depending on slice logic, or just indices 2,3,4) and all columns.

In [ ]:
print(df.iloc[2:5])

      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston   90000
4      Eva   22  Phoenix   60000

Row and Column Slicing (Label): Use loc to select the "Name" and "Age" for the rows with index labels 1, 3, and 5.

In [ ]:
print(df.loc[[1, 3, 5], ["Name", "Age"]])

    Name  Age
1    Bob   30
3  David   40
5  Frank   28

Cell Access: Use iloc to print the "City" of the 4th row (index 3).

In [ ]:
df.iloc[[4],[2]]

      City
4  Phoenix

Head and Tail: Print the first 3 rows and the last 2 rows of the DataFrame in a single script execution.

In [ ]:
print("First 3 Elements : \n" , df.head(3))
print("\nLast 2 Elements : \n", df.tail(2))

First 3 Elements :
       Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000

Last 2 Elements :
     Name  Age          City  Salary
5  Frank   28  Philadelphia   75000
6  Grace   45   San Antonio  110000

Describe Objects: Use df.describe() but try to include all columns (including objects like strings), not just numbers. (Hint: look up include='all' or check dtypes).

In [ ]:
# print(df.describe())
print(df.describe(include='all'))

         Name        Age      City         Salary
count       7   7.000000         7       7.000000
unique      7        NaN         7            NaN
top     Alice        NaN  New York            NaN
freq        1        NaN         1            NaN
mean      NaN  32.142857       NaN   86428.571429
std       NaN   8.275034       NaN   21739.803302
min       NaN  22.000000       NaN   60000.000000
25%       NaN  26.500000       NaN   72500.000000
50%       NaN  30.000000       NaN   80000.000000
75%       NaN  37.500000       NaN  100000.000000
max       NaN  45.000000       NaN  120000.000000

Rename Single: Rename the "Salary" column to "Annual Income" in place (or reassign to df).

In [ ]:
print(df.rename(columns={'Salary':'Annual Income'}))

      Name  Age          City  Annual Income
0    Alice   25      New York          70000
1      Bob   30   Los Angeles          80000
2  Charlie   35       Chicago         120000
3    David   40       Houston          90000
4      Eva   22       Phoenix          60000
5    Frank   28  Philadelphia          75000
6    Grace   45   San Antonio         110000

Rename Multiple: Rename "Name" to "Full Name" and "City" to "Location" simultaneously.

In [ ]:
print(df.rename(columns={'Name':'Full Name','City':'Location'}))

  Full Name  Age      Location  Salary
0     Alice   25      New York   70000
1       Bob   30   Los Angeles   80000
2   Charlie   35       Chicago  120000
3     David   40       Houston   90000
4       Eva   22       Phoenix   60000
5     Frank   28  Philadelphia   75000
6     Grace   45   San Antonio  110000

Drop Column: Remove the "City" column from the DataFrame.

In [ ]:
print(df.drop("City" , axis=1))

      Name  Age  Salary
0    Alice   25   70000
1      Bob   30   80000
2  Charlie   35  120000
3    David   40   90000
4      Eva   22   60000
5    Frank   28   75000
6    Grace   45  110000

Drop Row: Remove the row at index 3.

In [ ]:
print(df.drop(3))

      Name  Age          City  Salary
0    Alice   25      New York   70000
1      Bob   30   Los Angeles   80000
2  Charlie   35       Chicago  120000
4      Eva   22       Phoenix   60000
5    Frank   28  Philadelphia   75000
6    Grace   45   San Antonio  110000

Add Constant Column: Add a new column "Country" and populate it with "USA" for all rows.

In [ ]:
df["Country"] = "USA"
print(df)

      Name  Age          City  Salary Country
0    Alice   25      New York   70000     USA
1      Bob   30   Los Angeles   80000     USA
2  Charlie   35       Chicago  120000     USA
3    David   40       Houston   90000     USA
4      Eva   22       Phoenix   60000     USA
5    Frank   28  Philadelphia   75000     USA
6    Grace   45   San Antonio  110000     USA

Add Calculated Column (Born Year): Assuming the current year is 2025, create a new column "Birth Year" by subtracting "Age" from 2025.

In [ ]:
df["Born Year"] = 2025 - df["Age"]
print(df)

      Name  Age          City  Salary Country  Born Year
0    Alice   25      New York   70000     USA       2000
1      Bob   30   Los Angeles   80000     USA       1995
2  Charlie   35       Chicago  120000     USA       1990
3    David   40       Houston   90000     USA       1985
4      Eva   22       Phoenix   60000     USA       2003
5    Frank   28  Philadelphia   75000     USA       1997
6    Grace   45   San Antonio  110000     USA       1980

Add List Column: Add a new column "Department" using this list: ['HR', 'Eng', 'Eng', 'Sales', 'HR', 'Sales', 'Admin'].

In [ ]:
data = ["HR", "Eng", "Eng", "Sales", "HR", "Sales", "Admin"]
df["Department"] = data
print(df)

      Name  Age          City  Salary Country  Born Year Department
0    Alice   25      New York   70000     USA       2000         HR
1      Bob   30   Los Angeles   80000     USA       1995        Eng
2  Charlie   35       Chicago  120000     USA       1990        Eng
3    David   40       Houston   90000     USA       1985      Sales
4      Eva   22       Phoenix   60000     USA       2003         HR
5    Frank   28  Philadelphia   75000     USA       1997      Sales
6    Grace   45   San Antonio  110000     USA       1980      Admin

Numpy conversion: Convert the underlying data of the DataFrame to a NumPy array and print it.

In [ ]:
print(df.to_numpy())

[['Alice' 25 'New York' 70000 'USA' 2000 'HR']
 ['Bob' 30 'Los Angeles' 80000 'USA' 1995 'Eng']
 ['Charlie' 35 'Chicago' 120000 'USA' 1990 'Eng']
 ['David' 40 'Houston' 90000 'USA' 1985 'Sales']
 ['Eva' 22 'Phoenix' 60000 'USA' 2003 'HR']
 ['Frank' 28 'Philadelphia' 75000 'USA' 1997 'Sales']
 ['Grace' 45 'San Antonio' 110000 'USA' 1980 'Admin']]

Empty DataFrame: Create an empty DataFrame. Then add two columns "A" and "B" with 3 values each.

In [ ]:
df1 = pd.DataFrame()
df1["A"] = [1 , 2 , 3]
df1["B"] = [4 , 5 , 6]
print(df1)

   A  B
0  1  4
1  2  5
2  3  6

Reorder Columns: Rearrange the columns so that "Age" appears before "Name".
Conditional Update (Manual): Update the "Age" of "Alice" (index 0) to 26 using at or loc.

In [ ]:
print(df[["Age", "Name", "City", "Salary", "Country", "Born Year", "Department"]])

df.loc[0 ,"Age"] = 26
print(df)

   Age     Name          City  Salary Country  Born Year Department
0   25    Alice      New York   70000     USA       2000         HR
1   30      Bob   Los Angeles   80000     USA       1995        Eng
2   35  Charlie       Chicago  120000     USA       1990        Eng
3   40    David       Houston   90000     USA       1985      Sales
4   22      Eva       Phoenix   60000     USA       2003         HR
5   28    Frank  Philadelphia   75000     USA       1997      Sales
6   45    Grace   San Antonio  110000     USA       1980      Admin
      Name  Age          City  Salary Country  Born Year Department
0    Alice   26      New York   70000     USA       2000         HR
1      Bob   30   Los Angeles   80000     USA       1995        Eng
2  Charlie   35       Chicago  120000     USA       1990        Eng
3    David   40       Houston   90000     USA       1985      Sales
4      Eva   22       Phoenix   60000     USA       2003         HR
5    Frank   28  Philadelphia   75000     USA       1997      Sales
6    Grace   45   San Antonio  110000     USA       1980      Admin

Random Sample: specificy a random seed (optional) and select a random sample of 3 rows from the DataFrame.